cf_billing/Catalogs/энргВидыДифференцированности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыДифференцированности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормулуРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифныеЗоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормулыРасчетаУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчетаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыДифференцированности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуТарифныеЗоныВидовДифференцированности(Схема,ПараметрыОтбора,ТаблицаДляПомещения) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуТарифныеЗоныВидовДифференцированности());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойбазы

Процедура ОбновитьПредопределенныеЭлементы() Экспорт
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Однотарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.БезРазбивки;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Двухтарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.День;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Ночь;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Трехтарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.НочьТрехЗонная;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Полупик;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Пик;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуТарифныеЗоныВидовДифференцированности()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргВидыДифференцированностиТарифныеЗоны.Ссылка КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
